{
  "architectures": [
    "Qwen2Model"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoModel": "modeling_qwen.Qwen2Model",
    "AutoModelForCausalLM": "modeling_qwen.Qwen2Model",
    "AutoModelForSequenceClassification": "modeling_qwen.Qwen2Model"
  },
  "bos_token_id": 151643,
  "eos_token_id": 151643,
  "hidden_act": "silu",
  "hidden_size": 1536,
  "initializer_range": 0.02,
  "intermediate_size": 8960,
  "is_causal": false,
  "max_position_embeddings": 131072,
  "max_window_layers": 21,
  "model_type": "qwen2",
  "num_attention_heads": 12,
  "num_hidden_layers": 28,
  "num_key_value_heads": 2,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000.0,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.48.0",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151646
}